{
  "jobTitle": "Product Manager",
  "department": "Business Development",
  "location": "Cairo, EG",
  "description": "At The Design Grit (TDG), we’re revolutionizing the e-commerce furniture market by connecting customers with premium products from multiple vendors. We’re seeking a passionate and strategic Product Manager to join our team and help shape the future of online furniture shopping.",
  "responsibilities": [
    "Define and own the product vision, strategy, and roadmap in alignment with company goals.",
    "Work closely with design, engineering, marketing, and vendor teams to create seamless and user-friendly experiences.",
    "Conduct research to understand customer needs, market trends, and competitor strategies to guide product development.",
    "Translate business goals into detailed feature requirements and user stories, ensuring clear communication with development teams.",
    "Use analytics and customer feedback to prioritize features and measure product success.",
    "Ensure timely delivery of product updates, manage project timelines, and communicate progress to stakeholders.",
    "Optimize the platform for smooth onboarding and management of furniture vendors."
  ],
  "requirements": [
    "Experience: 3+ years of product management experience, preferably in e-commerce or a similar field.",
    "Education: Bachelor’s degree in business, computer science, or a related field.",
    "Skills: Strong analytical and problem-solving skills.",
    "Excellent communication and stakeholder management abilities.",
    "Proficiency in project management tools and data analytics platforms.",
    "Experience with Agile methodologies and product lifecycle management.",
    "Bonus: Experience working with vendor-driven marketplaces or knowledge of the furniture industry."
  ],
  "whatWeOffer": [
    "Competitive salary and performance-based bonuses.",
    "Flexible working options, including remote and hybrid setups.",
    "A collaborative, innovative, and supportive work environment.",
    "Opportunities for career growth and professional development.",
    "Exclusive employee discounts on premium furniture and home décor.",
    "Comprehensive health insurance and wellness programs.",
    "Paid time off to recharge and pursue personal interests."
  ]
}
